In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
h=pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
h

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [4]:
d=pd.date_range("20011231",periods=10)
d

DatetimeIndex(['2001-12-31', '2002-01-01', '2002-01-02', '2002-01-03',
               '2002-01-04', '2002-01-05', '2002-01-06', '2002-01-07',
               '2002-01-08', '2002-01-09'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=["A","B","C","D"])
df

                   A         B         C         D
2001-12-31 -0.406816  0.547716  1.131047  0.493786
2002-01-01  0.114830 -1.201789 -0.480451  1.296259
2002-01-02 -0.149815  1.340481 -0.615081  0.978135
2002-01-03  0.933508 -1.443527  1.139573 -1.872387
2002-01-04  0.294547 -0.096163  1.210580 -0.349508
2002-01-05 -0.443673  0.595833  0.436814 -0.607595
2002-01-06 -0.491680 -0.153775 -0.047082 -0.767054
2002-01-07 -0.095448 -1.739983  0.679127  0.101511
2002-01-08  1.376077  0.669776 -0.663579 -0.746900
2002-01-09 -1.827495  0.168753  2.104594 -1.991743

In [6]:
d1=pd.DataFrame({
    "A":[1,2,3,4],
    "B":pd.Timestamp("20001010"),
    "C":pd.Series(1,index=list(range(4)),dtype="float32"),
    "D":np.array([5]*4,dtype="int32"),
    "E":pd.Categorical(["true","false","True","False"]),
    "F":"Pandas"
})
d1

   A          B    C  D      E       F
0  1 2000-10-10  1.0  5   true  Pandas
1  2 2000-10-10  1.0  5  false  Pandas
2  3 2000-10-10  1.0  5   True  Pandas
3  4 2000-10-10  1.0  5  False  Pandas

In [7]:
d1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [9]:
df.head()

                   A         B         C         D
2001-12-31 -0.406816  0.547716  1.131047  0.493786
2002-01-01  0.114830 -1.201789 -0.480451  1.296259
2002-01-02 -0.149815  1.340481 -0.615081  0.978135
2002-01-03  0.933508 -1.443527  1.139573 -1.872387
2002-01-04  0.294547 -0.096163  1.210580 -0.349508

In [10]:
df.tail()

                   A         B         C         D
2002-01-05 -0.443673  0.595833  0.436814 -0.607595
2002-01-06 -0.491680 -0.153775 -0.047082 -0.767054
2002-01-07 -0.095448 -1.739983  0.679127  0.101511
2002-01-08  1.376077  0.669776 -0.663579 -0.746900
2002-01-09 -1.827495  0.168753  2.104594 -1.991743

In [11]:
df.index

DatetimeIndex(['2001-12-31', '2002-01-01', '2002-01-02', '2002-01-03',
               '2002-01-04', '2002-01-05', '2002-01-06', '2002-01-07',
               '2002-01-08', '2002-01-09'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.to_numpy()

array([[-0.40681554,  0.54771596,  1.13104682,  0.49378612],
       [ 0.11483009, -1.20178885, -0.48045095,  1.29625924],
       [-0.14981487,  1.34048113, -0.61508075,  0.97813549],
       [ 0.93350797, -1.44352744,  1.13957258, -1.87238707],
       [ 0.29454695, -0.09616293,  1.21058026, -0.34950767],
       [-0.44367304,  0.59583317,  0.43681387, -0.60759522],
       [-0.49167955, -0.15377456, -0.04708165, -0.76705449],
       [-0.09544834, -1.73998314,  0.67912687,  0.10151135],
       [ 1.37607716,  0.66977588, -0.66357896, -0.74689968],
       [-1.8274955 ,  0.16875314,  2.10459363, -1.99174274]])

In [14]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.069596  -0.131268   0.489554  -0.346549
std     0.868710   1.018996   0.929744   1.095477
min    -1.827495  -1.739983  -0.663579  -1.991743
25%    -0.434459  -0.939785  -0.372109  -0.762016
50%    -0.122632   0.036295   0.557970  -0.478551
75%     0.249618   0.583804   1.137441   0.395717
max     1.376077   1.340481   2.104594   1.296259

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2001-12-31 to 2002-01-09
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
dtypes: float64(4)
memory usage: 400.0 bytes

In [16]:
df["C"]

2001-12-31    1.131047
2002-01-01   -0.480451
2002-01-02   -0.615081
2002-01-03    1.139573
2002-01-04    1.210580
2002-01-05    0.436814
2002-01-06   -0.047082
2002-01-07    0.679127
2002-01-08   -0.663579
2002-01-09    2.104594
Freq: D, Name: C, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2001-12-31 -0.406816  0.547716  1.131047  0.493786
2002-01-01  0.114830 -1.201789 -0.480451  1.296259
2002-01-02 -0.149815  1.340481 -0.615081  0.978135

In [18]:
df.loc[d[0]]

A   -0.406816
B    0.547716
C    1.131047
D    0.493786
Name: 2001-12-31 00:00:00, dtype: float64

In [19]:
df.loc[:,["A","C"]]

                   A         C
2001-12-31 -0.406816  1.131047
2002-01-01  0.114830 -0.480451
2002-01-02 -0.149815 -0.615081
2002-01-03  0.933508  1.139573
2002-01-04  0.294547  1.210580
2002-01-05 -0.443673  0.436814
2002-01-06 -0.491680 -0.047082
2002-01-07 -0.095448  0.679127
2002-01-08  1.376077 -0.663579
2002-01-09 -1.827495  2.104594

In [20]:
df.loc["20011231":"20020105",["D","C"]]

                   D         C
2001-12-31  0.493786  1.131047
2002-01-01  1.296259 -0.480451
2002-01-02  0.978135 -0.615081
2002-01-03 -1.872387  1.139573
2002-01-04 -0.349508  1.210580
2002-01-05 -0.607595  0.436814

In [21]:
df.loc["20011231",["D","C"]]

D    0.493786
C    1.131047
Name: 2001-12-31 00:00:00, dtype: float64

In [22]:
df.loc[d[0],["D","C"]]

D    0.493786
C    1.131047
Name: 2001-12-31 00:00:00, dtype: float64

In [23]:
df.at[d[0],"C"]

1.1310468159244662

In [24]:
df.iloc[3]

A    0.933508
B   -1.443527
C    1.139573
D   -1.872387
Name: 2002-01-03 00:00:00, dtype: float64

In [25]:
df.iloc[3:5]

                   A         B         C         D
2002-01-03  0.933508 -1.443527  1.139573 -1.872387
2002-01-04  0.294547 -0.096163  1.210580 -0.349508

In [26]:
df2=df.reindex(index=d[0:4],columns=list(df.columns)+["E"])
df2.loc[d[0]:d[1], "E"]=1
df2

                   A         B         C         D    E
2001-12-31 -0.406816  0.547716  1.131047  0.493786  1.0
2002-01-01  0.114830 -1.201789 -0.480451  1.296259  1.0
2002-01-02 -0.149815  1.340481 -0.615081  0.978135  NaN
2002-01-03  0.933508 -1.443527  1.139573 -1.872387  NaN

In [27]:
df2.isnull()

                A      B      C      D      E
2001-12-31  False  False  False  False  False
2002-01-01  False  False  False  False  False
2002-01-02  False  False  False  False   True
2002-01-03  False  False  False  False   True

In [28]:
df2.dropna()

                   A         B         C         D    E
2001-12-31 -0.406816  0.547716  1.131047  0.493786  1.0
2002-01-01  0.114830 -1.201789 -0.480451  1.296259  1.0

In [29]:
df2.fillna(value=2)

                   A         B         C         D    E
2001-12-31 -0.406816  0.547716  1.131047  0.493786  1.0
2002-01-01  0.114830 -1.201789 -0.480451  1.296259  1.0
2002-01-02 -0.149815  1.340481 -0.615081  0.978135  2.0
2002-01-03  0.933508 -1.443527  1.139573 -1.872387  2.0

In [30]:
df2.mean()

A    0.122927
B   -0.189280
C    0.293772
D    0.223948
E    1.000000
dtype: float64

In [31]:
df2.mode()

          A         B         C         D    E
0 -0.406816 -1.443527 -0.615081 -1.872387  1.0
1 -0.149815 -1.201789 -0.480451  0.493786  NaN
2  0.114830  0.547716  1.131047  0.978135  NaN
3  0.933508  1.340481  1.139573  1.296259  NaN

In [33]:
df2.median()

A   -0.017492
B   -0.327036
C    0.325298
D    0.735961
E    1.000000
dtype: float64

In [34]:
f=pd.Series(["aman","abhijith","dj",np.nan])
f.str.upper()

0        AMAN
1    ABHIJITH
2          DJ
3         NaN
dtype: object

In [36]:
g=pd.DataFrame(np.random.randn(10,4))
g

          0         1         2         3
0  1.585464  0.553448 -0.913830 -1.723692
1  0.754023 -2.246467  0.778610 -0.792833
2  1.001160 -2.661350  0.818519  0.078039
3 -1.120185 -0.133409 -1.868078 -1.324880
4 -1.829651  0.736719 -1.564462  0.383907
5 -0.018194  2.798185  1.985040 -0.202325
6 -0.885517 -0.056677 -0.039680  1.153925
7  0.750213  1.574371 -0.149987  1.011906
8  0.198450  1.042431 -0.735250 -0.726865
9  0.490626  0.281672  1.028510 -0.707464

In [37]:
q=[g[:3],g[3:7],g[7:]]
q

[          0         1         2         3
 0  1.585464  0.553448 -0.913830 -1.723692
 1  0.754023 -2.246467  0.778610 -0.792833
 2  1.001160 -2.661350  0.818519  0.078039,
           0         1         2         3
 3 -1.120185 -0.133409 -1.868078 -1.324880
 4 -1.829651  0.736719 -1.564462  0.383907
 5 -0.018194  2.798185  1.985040 -0.202325
 6 -0.885517 -0.056677 -0.039680  1.153925,
           0         1         2         3
 7  0.750213  1.574371 -0.149987  1.011906
 8  0.198450  1.042431 -0.735250 -0.726865
 9  0.490626  0.281672  1.028510 -0.707464]

In [38]:
pd.concat(q)

          0         1         2         3
0  1.585464  0.553448 -0.913830 -1.723692
1  0.754023 -2.246467  0.778610 -0.792833
2  1.001160 -2.661350  0.818519  0.078039
3 -1.120185 -0.133409 -1.868078 -1.324880
4 -1.829651  0.736719 -1.564462  0.383907
5 -0.018194  2.798185  1.985040 -0.202325
6 -0.885517 -0.056677 -0.039680  1.153925
7  0.750213  1.574371 -0.149987  1.011906
8  0.198450  1.042431 -0.735250 -0.726865
9  0.490626  0.281672  1.028510 -0.707464